//Задача о коллекции функций: у вас есть массив функций, напишите код, который вызовет каждую функцию в этом массиве и выведет их порядковый номер.
// Однако, вызов каждой функции должен происходить только после вызова предыдущей функции.
// Другими словами, нужно выполнить следующие шаги:
// Вызвать первую функцию из массива.
// После завершения работы первой функции вызвать вторую функцию.
// После завершения работы второй функции вызвать третью функцию.
// И так далее, пока все функции в массиве не будут вызваны по порядку.
const array = [(i) => console.log(`First ${i}`), (i) => console.log(`Second ${i}`), (i) => console.log(`Third ${i}`)];
const collectionOfFunctions = (arr) => {
    arr.forEach((fn, index) => fn(index + 1));
};