//Задача на промисы: напишите функцию, которая принимает URL изображения и возвращает промис,
// который разрешается с данными об изображении, когда оно загружено.
// Когда говорится "промис разрешается с данными об изображении",
// это означает, что промис должен быть успешно выполнен (resolved) с данными об изображении после того,
// как изображение будет загружено.

const getImg = async (url) => {
    try {
        const request = await fetch(url);
        if (request.ok) {
            return await request.blob();
        }
    } catch (e) {
        console.error(e);
    }
};